digitie/canview/firmware/communicator/stm32/platform/stm32g474/uart_dma.c
static void disable_interrupts(void)
{
    NVIC_DisableIRQ(DMA1_Channel1_IRQn);
    NVIC_DisableIRQ(DMA1_Channel2_IRQn);
    NVIC_DisableIRQ(USART2_IRQn);
    NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);
    NVIC_ClearPendingIRQ(DMA1_Channel2_IRQn);
    NVIC_ClearPendingIRQ(USART2_IRQn);
}

static bool cts_is_blocked(void)
{
    /* The external ESP32 RTS output is active-low and pulled high at reset. */
    return (GPIOA->IDR & (UINT32_C(1) << CANVIEW_BOARD_ESP_RTS_PIN)) == 0U;
}

static bool sample_rx_total(const canview_stm_uart_platform_t *platform,
                            uint64_t *producer_total)
{
    if (platform == NULL || producer_total == NULL)
    {
        return false;
    }
    for (size_t attempt = 0U; attempt < 3U; ++attempt)
    {
        const uint32_t wraps_before = platform->rx_wrap_count_isr;
        const uint32_t remaining = DMA1_Channel1->CNDTR;
        __DMB();
        const uint32_t wraps_after = platform->rx_wrap_count_isr;
        if (wraps_before != wraps_after)
        {
            continue;
        }
        if (remaining > CANVIEW_STM_UART_PLATFORM_RX_CAPACITY)
        {
            return false;
        }
        const uint32_t position = remaining == 0U
                                       ? (uint32_t)CANVIEW_STM_UART_PLATFORM_RX_CAPACITY
                                       : (uint32_t)CANVIEW_STM_UART_PLATFORM_RX_CAPACITY - remaining;
        const uint32_t capacity = (uint32_t)CANVIEW_STM_UART_PLATFORM_RX_CAPACITY;
        if ((uint64_t)wraps_before > UINT64_MAX / (uint64_t)capacity)
        {
            return false;
        }
        uint64_t total = (uint64_t)wraps_before * (uint64_t)capacity + position;
        /* A transfer-complete IRQ can be pending while CNDTR already wrapped. */
        if (total < platform->rx_read_total)
        {
            const uint64_t lag = platform->rx_read_total - total;
            if (lag > capacity || total > UINT64_MAX - capacity)
            {
                return false;
            }
            total += capacity;
        }
        *producer_total = total;
        return true;
    }
    return false;
}

static uint32_t take_events(canview_stm_uart_platform_t *platform, bool *rx_error,
                            bool *tx_error, bool *tx_done)
{
    const uint32_t saved_mask = canview_stm_critical_enter(NULL);
    const uint32_t events = platform->events;
    *rx_error = platform->rx_error_pending;
    *tx_error = platform->tx_error_pending;
    *tx_done = platform->tx_done_pending;
    platform->events = 0U;
    platform->rx_error_pending = false;
    platform->tx_error_pending = false;
    platform->tx_done_pending = false;
    canview_stm_critical_leave(NULL, saved_mask);
    return events;
}

static void abort_tx_dma(canview_stm_uart_platform_t *platform)
{
    DMA1_Channel2->CCR &= ~DMA_CCR_EN;
    USART2->CR3 &= ~USART_CR3_DMAT;
    DMA1->IFCR = CANVIEW_STM_UART_TX_DMA_CLEAR;
    platform->tx_in_flight = false;
}

static canview_status_t reset_rx_dma(canview_stm_uart_platform_t *platform,
                                     uint64_t now_ms, uint64_t now_us)
{
    canview_status_t result = CANVIEW_OK;
    NVIC_DisableIRQ(DMA1_Channel1_IRQn);
    NVIC_DisableIRQ(DMA1_Channel2_IRQn);
    NVIC_DisableIRQ(USART2_IRQn);
    NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);
    NVIC_ClearPendingIRQ(DMA1_Channel2_IRQn);
    NVIC_ClearPendingIRQ(USART2_IRQn);
    abort_tx_dma(platform);
    DMA1_Channel1->CCR &= ~DMA_CCR_EN;
    USART2->CR3 &= ~USART_CR3_DMAR;
    DMA1->IFCR = CANVIEW_STM_UART_RX_DMA_CLEAR;
    USART2->ICR = CANVIEW_STM_UART_USART_ERROR_CLEAR | USART_ICR_IDLECF | USART_ICR_CTSCF;
    USART2->RQR = USART_RQR_RXFRQ;
    result = canview_stm_uart_reset(platform->config.runtime, now_ms, now_us);
    if (result == CANVIEW_OK)
    {
        memset(platform->config.rx_buffer, 0, platform->config.rx_capacity);
        DMA1_Channel1->CPAR = (uint32_t)(uintptr_t)&USART2->RDR;
        DMA1_Channel1->CMAR = (uint32_t)(uintptr_t)platform->config.rx_buffer;
        DMA1_Channel1->CNDTR = (uint32_t)CANVIEW_STM_UART_PLATFORM_RX_CAPACITY;
        DMA1_Channel1->CCR = DMA_CCR_MINC | DMA_CCR_CIRC | DMA_CCR_HTIE | DMA_CCR_TCIE |
                             DMA_CCR_TEIE | CANVIEW_STM_UART_DMA_PRIORITY;
        DMA1_Channel1->CCR |= DMA_CCR_EN;
        USART2->CR3 |= USART_CR3_DMAR;
        platform->rx_read_total = 0U;
        platform->rx_wrap_count_isr = 0U;
        platform->events = 0U;
        platform->rx_error_pending = false;
        platform->tx_error_pending = false;
        platform->tx_done_pending = false;
    }
    NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);
    NVIC_ClearPendingIRQ(DMA1_Channel2_IRQn);
    NVIC_ClearPendingIRQ(USART2_IRQn);
    NVIC_EnableIRQ(DMA1_Channel1_IRQn);
    NVIC_EnableIRQ(DMA1_Channel2_IRQn);
    NVIC_EnableIRQ(USART2_IRQn);
    return result;
}

static bool input_status_nonfatal(canview_status_t status)
{
    switch (status)
    {
    case CANVIEW_OK:
    case CANVIEW_INCOMPLETE:
    case CANVIEW_MALFORMED:
    case CANVIEW_UNSUPPORTED_VERSION:
    case CANVIEW_UNSUPPORTED_MESSAGE:
    case CANVIEW_CRC_MISMATCH:
    case CANVIEW_OVERSIZE:
    case CANVIEW_DUPLICATE:
    case CANVIEW_STALE:
    case CANVIEW_NOT_IMPLEMENTED:
    case CANVIEW_AUTH_FAILED:
    case CANVIEW_RESOURCE_BUSY:
    case CANVIEW_TIMEOUT:
        return true;
    default:
        return false;
    }
}

static canview_status_t consume_rx(canview_stm_uart_platform_t *platform, uint64_t producer_total,
                                   uint64_t now_ms, uint64_t now_us, size_t rx_budget)
{
    const uint64_t available = producer_total - platform->rx_read_total;
    if (available > (uint64_t)CANVIEW_STM_UART_PLATFORM_RX_CAPACITY)
    {
        return CANVIEW_OVERSIZE;
    }
    const uint64_t bounded_budget = (uint64_t)rx_budget;
    const uint64_t count = available < bounded_budget ? available : bounded_budget;
    __DMB();
    for (uint64_t index = 0U; index < count; ++index)
    {
        const uint32_t buffer_index =
            (uint32_t)(platform->rx_read_total &
                       ((uint64_t)CANVIEW_STM_UART_PLATFORM_RX_CAPACITY - UINT64_C(1)));
        const uint8_t byte = platform->config.rx_buffer[buffer_index];
        const canview_status_t status = canview_stm_uart_ingest_byte(
            platform->config.runtime, byte, now_ms, now_us);
        platform->rx_read_total++;
        if (!input_status_nonfatal(status))
        {
            return status;
        }
    }
    return CANVIEW_OK;
}

static canview_status_t start_tx_dma(canview_stm_uart_platform_t *platform)
{
    const uint8_t *data = NULL;
    size_t size = 0U;
    uint32_t sequence = 0U;
    const canview_status_t begin_status =
        canview_stm_uart_tx_begin(platform->config.runtime, &data, &size, &sequence);
    (void)sequence;
    if (begin_status == CANVIEW_INCOMPLETE)
    {
        return CANVIEW_OK;
    }
    if (begin_status != CANVIEW_OK || data == NULL || size == 0U || size > UINT16_MAX)
    {
        return begin_status == CANVIEW_OK ? CANVIEW_MALFORMED : begin_status;
    }
    DMA1_Channel2->CCR &= ~DMA_CCR_EN;
    DMA1->IFCR = CANVIEW_STM_UART_TX_DMA_CLEAR;
    DMA1_Channel2->CMAR = (uint32_t)(uintptr_t)data;
    DMA1_Channel2->CNDTR = (uint32_t)size;
    DMA1_Channel2->CCR = DMA_CCR_DIR | DMA_CCR_MINC | DMA_CCR_TCIE | DMA_CCR_TEIE |
                         CANVIEW_STM_UART_DMA_PRIORITY;
    __DMB();
    USART2->CR3 |= USART_CR3_DMAT;
    DMA1_Channel2->CCR |= DMA_CCR_EN;
    platform->tx_in_flight = true;
    return CANVIEW_OK;
}

canview_status_t canview_stm_uart_platform_init(
    canview_stm_uart_platform_t *platform,
    const canview_stm_uart_platform_config_t *config)
{
    if (platform == NULL || config == NULL || config->runtime == NULL ||
        !config->runtime->initialized || config->rx_buffer == NULL ||
        config->rx_capacity != CANVIEW_STM_UART_PLATFORM_RX_CAPACITY ||
        (((uintptr_t)config->rx_buffer & (uintptr_t)3U) != 0U))
    {
        return CANVIEW_INVALID_ARGUMENT;
    }
    if (platform->initialized || active_platform != NULL)
    {
        return CANVIEW_RESOURCE_BUSY;
    }
    memset(platform, 0, sizeof(*platform));
    platform->config = *config;
    platform->initialized = true;
    return CANVIEW_OK;
}

canview_status_t canview_stm_uart_platform_start(canview_stm_uart_platform_t *platform)
{
    if (platform == NULL || !platform->initialized || platform->config.runtime == NULL ||
        !platform->config.runtime->initialized)
    {
        return CANVIEW_INVALID_ARGUMENT;
    }
    if (platform->started || platform->servicing || active_platform != NULL || !clock_ready())
    {
        return platform->started || platform->servicing || active_platform != NULL
                   ? CANVIEW_RESOURCE_BUSY
                   : CANVIEW_INVALID_ARGUMENT;
    }
    const canview_status_t reset_status = canview_stm_uart_reset(
        platform->config.runtime, (uint64_t)canview_stm_board_now_ms(),
        canview_stm_now_us64(NULL));
    if (reset_status != CANVIEW_OK)
    {
        return reset_status;
    }
    RCC->AHB1ENR |= RCC_AHB1ENR_DMA1EN | RCC_AHB1ENR_DMAMUX1EN;
    RCC->APB1ENR1 |= RCC_APB1ENR1_USART2EN;
    (void)RCC->AHB1ENR;
    (void)RCC->APB1ENR1;
    configure_uart_gpio();
    disable_dma();
    disable_usart();
    clear_dma_flags();
    configure_dma_requests();
    configure_dma_channels(platform->config.rx_buffer);
    configure_usart();
    DMA1_Channel1->CCR |= DMA_CCR_EN;
    reset_adapter_counters(platform);
    platform->started = true;
    platform->events = CANVIEW_STM_UART_PLATFORM_EVENT_CTS;
    active_platform = platform;
    enable_interrupts();
    return CANVIEW_OK;
}

