digitie/canview/firmware/communicator/stm32/platform/stm32g474/uart_dma.c
canview_status_t canview_stm_uart_platform_stop(canview_stm_uart_platform_t *platform)
{
    if (platform == NULL || !platform->initialized)
    {
        return CANVIEW_INVALID_ARGUMENT;
    }
    if (active_platform != NULL && active_platform != platform)
    {
        return CANVIEW_RESOURCE_BUSY;
    }
    if (platform->servicing)
    {
        return CANVIEW_RESOURCE_BUSY;
    }
    if (active_platform == platform)
    {
        active_platform = NULL;
    }
    disable_interrupts();
    disable_dma();
    disable_usart();
    configure_uart_gpio_input();
    platform->started = false;
    reset_adapter_counters(platform);
    return CANVIEW_OK;
}

canview_status_t canview_stm_uart_platform_service(canview_stm_uart_platform_t *platform,
                                                    uint64_t now_ms, uint64_t now_us,
                                                    size_t rx_budget)
{
    if (platform == NULL || !platform->initialized || !platform->started ||
        platform->config.runtime == NULL || !platform->config.runtime->initialized ||
        rx_budget == 0U)
    {
        return CANVIEW_INVALID_ARGUMENT;
    }
    if (platform->servicing)
    {
        return CANVIEW_RESOURCE_BUSY;
    }
    platform->servicing = true;
    bool rx_error = false;
    bool tx_error = false;
    bool tx_done = false;
    const uint32_t events = take_events(platform, &rx_error, &tx_error, &tx_done);
    (void)events;

    uint64_t producer_total = 0U;
    const bool producer_valid = sample_rx_total(platform, &producer_total);
    canview_status_t result = CANVIEW_OK;
    bool reset_happened = false;
    if (!producer_valid || rx_error)
    {
        if (!producer_valid)
        {
            producer_total = platform->rx_read_total;
        }
        const canview_status_t recovery_status =
            reset_rx_dma(platform, now_ms, now_us);
        reset_happened = true;
        if (recovery_status != CANVIEW_OK)
        {
            result = recovery_status;
            goto service_done;
        }
        producer_total = platform->rx_read_total;
    }
    else if (producer_total - platform->rx_read_total >
             (uint64_t)CANVIEW_STM_UART_PLATFORM_RX_CAPACITY)
    {
        const canview_status_t recovery_status =
            reset_rx_dma(platform, now_ms, now_us);
        reset_happened = true;
        if (recovery_status != CANVIEW_OK)
        {
            result = recovery_status;
            goto service_done;
        }
        producer_total = platform->rx_read_total;
    }

    if (tx_error)
    {
        if (platform->tx_in_flight)
        {
            abort_tx_dma(platform);
            const canview_status_t finish_status = canview_stm_uart_tx_finish(
                platform->config.runtime, CANVIEW_TIMEOUT, now_ms);
            if (finish_status != CANVIEW_TIMEOUT)
            {
                result = finish_status;
                goto service_done;
            }
        }
        const canview_status_t reset_status =
            canview_stm_uart_reset(platform->config.runtime, now_ms, now_us);
        reset_happened = true;
        if (reset_status != CANVIEW_OK)
        {
            result = reset_status;
            goto service_done;
        }
    }
    else if (tx_done && platform->tx_in_flight)
    {
        platform->tx_in_flight = false;
        USART2->CR3 &= ~USART_CR3_DMAT;
        const canview_status_t finish_status =
            canview_stm_uart_tx_finish(platform->config.runtime, CANVIEW_OK, now_ms);
        if (finish_status != CANVIEW_OK)
        {
            result = finish_status;
            goto service_done;
        }
    }

    if (!reset_happened)
    {
        const canview_status_t rx_status =
            consume_rx(platform, producer_total, now_ms, now_us, rx_budget);
        if (rx_status != CANVIEW_OK)
        {
            result = rx_status;
            goto service_done;
        }
    }

    const bool sampled_cts_blocked = cts_is_blocked();
    if (reset_happened || !platform->config.runtime->cts_known ||
        platform->config.runtime->cts_blocked != sampled_cts_blocked ||
        (events & CANVIEW_STM_UART_PLATFORM_EVENT_CTS) != 0U)
    {
        const canview_status_t cts_status = canview_stm_uart_set_cts_blocked(
            platform->config.runtime, sampled_cts_blocked, now_ms);
        if (cts_status != CANVIEW_OK && cts_status != CANVIEW_TIMEOUT)
        {
            result = cts_status;
            goto service_done;
        }
    }

    const canview_status_t tick_status =
        canview_stm_uart_tick(platform->config.runtime, now_ms, now_us);
    if (tick_status != CANVIEW_OK)
    {
        result = tick_status;
        goto service_done;
    }
    if (!platform->tx_in_flight)
    {
        const canview_status_t tx_status = start_tx_dma(platform);
        if (tx_status != CANVIEW_OK)
        {
            result = tx_status;
            goto service_done;
        }
    }

service_done:
    platform->servicing = false;
    return result;
}

uint64_t canview_stm_uart_platform_device_id(void)
{
    const volatile uint32_t *const uid = (const volatile uint32_t *)CANVIEW_STM_UART_ID_UID_BASE;
    uint32_t hash = UINT32_C(2166136261);
    for (size_t index = 0U; index < 3U; ++index)
    {
        const uint32_t word = uid[index];
        for (size_t byte = 0U; byte < 4U; ++byte)
        {
            hash ^= (word >> (byte * 8U)) & UINT32_C(0xff);
            hash *= UINT32_C(16777619);
        }
    }
    return hash == 0U ? UINT64_C(0) : ((uint64_t)hash << 32U) | (uint64_t)(hash ^ UINT32_C(0xa5a5a5a5));
}

uint64_t canview_stm_uart_platform_boot_id(void)
{
    RCC->AHB2ENR |= RCC_AHB2ENR_RNGEN;
    (void)RCC->AHB2ENR;
    RNG->CR |= RNG_CR_RNGEN;
    uint32_t words[2] = {0U, 0U};
    for (size_t index = 0U; index < 2U; ++index)
    {
        bool ready = false;
        for (uint32_t attempt = 0U; attempt < CANVIEW_STM_UART_POLL_LIMIT; ++attempt)
        {
            const uint32_t status = RNG->SR;
            if ((status & (RNG_SR_CECS | RNG_SR_SECS)) != 0U)
            {
                return UINT64_C(0);
            }
            if ((status & RNG_SR_DRDY) != 0U)
            {
                words[index] = RNG->DR;
                ready = true;
                break;
            }
        }
        if (!ready)
        {
            return UINT64_C(0);
        }
    }
    const uint64_t boot_id = ((uint64_t)words[0] << 32U) | (uint64_t)words[1];
    return boot_id == 0U ? UINT64_C(0) : boot_id;
}

void DMA1_Channel1_IRQHandler(void)
{
    canview_stm_uart_platform_t *const platform = active_platform;
    const uint32_t flags = DMA1->ISR & CANVIEW_STM_UART_RX_DMA_FLAGS;
    if (flags != 0U)
    {
        DMA1->IFCR = CANVIEW_STM_UART_RX_DMA_CLEAR;
    }
    if (platform == NULL || !platform->started)
    {
        return;
    }
    if ((flags & (DMA_ISR_HTIF1 | DMA_ISR_TCIF1)) != 0U)
    {
        if ((flags & DMA_ISR_TCIF1) != 0U)
        {
            if (platform->rx_wrap_count_isr == UINT32_MAX)
            {
                platform->rx_error_pending = true;
                post_event(platform, CANVIEW_STM_UART_PLATFORM_EVENT_RX_ERROR);
            }
            else
            {
                ++platform->rx_wrap_count_isr;
            }
        }
        post_event(platform, CANVIEW_STM_UART_PLATFORM_EVENT_RX);
    }
    if ((flags & DMA_ISR_TEIF1) != 0U)
    {
        platform->rx_error_pending = true;
        post_event(platform, CANVIEW_STM_UART_PLATFORM_EVENT_RX_ERROR);
    }
}

void DMA1_Channel2_IRQHandler(void)
{
    canview_stm_uart_platform_t *const platform = active_platform;
    const uint32_t flags = DMA1->ISR & CANVIEW_STM_UART_TX_DMA_FLAGS;
    if (flags != 0U)
    {
        DMA1->IFCR = CANVIEW_STM_UART_TX_DMA_CLEAR;
    }
    if (platform == NULL || !platform->started)
    {
        return;
    }
    if ((flags & DMA_ISR_TEIF2) != 0U)
    {
        platform->tx_error_pending = true;
        post_event(platform, CANVIEW_STM_UART_PLATFORM_EVENT_TX_ERROR);
    }
    if ((flags & DMA_ISR_TCIF2) != 0U)
    {
        platform->tx_done_pending = true;
        post_event(platform, CANVIEW_STM_UART_PLATFORM_EVENT_TX_DONE);
    }
}

void USART2_IRQHandler(void)
{
    canview_stm_uart_platform_t *const platform = active_platform;
    const uint32_t status = USART2->ISR;
    if ((status & CANVIEW_STM_UART_USART_ERROR_FLAGS) != 0U)
    {
        USART2->ICR = CANVIEW_STM_UART_USART_ERROR_CLEAR;
        USART2->RQR = USART_RQR_RXFRQ;
        if (platform != NULL && platform->started)
        {
            platform->rx_error_pending = true;
            post_event(platform, CANVIEW_STM_UART_PLATFORM_EVENT_RX_ERROR |
                                      CANVIEW_STM_UART_PLATFORM_EVENT_RX);
        }
    }
    if ((status & USART_ISR_IDLE) != 0U)
    {
        USART2->ICR = USART_ICR_IDLECF;
        if (platform != NULL && platform->started)
        {
            post_event(platform, CANVIEW_STM_UART_PLATFORM_EVENT_RX);
        }
    }
    if ((status & USART_ISR_CTSIF) != 0U)
    {
        USART2->ICR = USART_ICR_CTSCF;
        if (platform != NULL && platform->started)
        {
            post_event(platform, CANVIEW_STM_UART_PLATFORM_EVENT_CTS);
        }
    }
}
